<?
    /* ============================================================================== */
    /* = ※ 결과 출력 페이지 ※                                                     = */
    /* = -------------------------------------------------------------------------- = */
    /* =   pp_cli_hub.php 파일에서 처리된 결과값을 출력하는 페이지입니다.           = */
    /* = -------------------------------------------------------------------------- = */
    /* =   연동시 오류가 발생하는 경우 아래의 주소로 접속하셔서 확인하시기 바랍니다.= */
    /* =   접속 주소 : http://testpay.kcp.co.kr/pgsample/FAQ/search_error.jsp       = */
    /* = -------------------------------------------------------------------------- = */
    /* = Copyright(c) 2012 KCP Inc. All Rights Reserved.                            = */
    /* ============================================================================== */
?>

<?
    /* ============================================================================== */
    /* =   지불 결과                                                                = */
    /* = -------------------------------------------------------------------------- = */
    $req_tx        = $_POST[ "req_tx"         ] ; // 요청 구분(승인/취소)
    $pay_method    = $_POST[ "pay_method"     ] ; // 요청한 수단
    /* = -------------------------------------------------------------------------- = */
	$res_cd        = $_POST[ "res_cd"         ] ; // 결과 코드
    $res_msg       = $_POST[ "res_msg"        ] ; // 결과 메세지
	/* = -------------------------------------------------------------------------- = */
    $ordr_idxx     = $_POST[ "ordr_idxx"      ] ; // 주문번호
    $phon_mny      = $_POST[ "phon_mny"       ] ; // 요청금액
    $good_name     = $_POST[ "good_name"      ] ; // 상품명
    $ordr_nm       = $_POST[ "ordr_nm"        ] ; // 요청자명
	/* = -------------------------------------------------------------------------- = */
    $ars_trade_no  = $_POST[ "ars_trade_no"   ] ; // KCP 거래등록번호
    $phon_no       = $_POST[ "phon_no"        ] ; // 전화번호 or 핸드폰번호
    $app_time      = $_POST[ "app_time"       ] ; // 요청시간
	$expr_dt       = $_POST[ "expr_dt"        ] ; // 결제 유효기간
    /* = -------------------------------------------------------------------------- = */
    $site_nm       = $_POST[ "site_nm"        ] ; // 사이트명
	/* = -------------------------------------------------------------------------- = */
	$cert_flg      = $_POST[ "cert_flg"       ] ; // 인증 or 비인증 구분
    $sig_flg       = $_POST[ "sig_flg"        ] ; // 호전환 구분
    $vnum_no       = $_POST[ "vnum_no"        ] ; // ARS 결제요청 전화번호
    /* = -------------------------------------------------------------------------- = */
?>

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" >
<head>
    <title>*** KCP Online Payment System [Version 6.0] ***</title>
    <link href="../css/sample.css" rel="stylesheet" type="text/css"/>
</head>

<body>

</body>
</html>
<script>
        alert('ARS 결제요청 완료');
        window.location.href = "/myOffice/index.php";
</script>